STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pRouter/STM32_WPAN/App/gatt_client_app.c
        LOG_INFO_APP("Descriptor UUID=0x%04X, handle=0x%04X-0x%04X-0x%04X",
                      uuid,
                      gattCharStartHdl,
                      gattCharValueHdl,
                      handle);
        if (a_ClientContext[index].ServiceChangedCharValueHdl == gattCharValueHdl)
        {
          a_ClientContext[index].ServiceChangedCharDescHdl = handle;
          LOG_INFO_APP(", Service Changed found\n");
        }
/* USER CODE BEGIN gatt_parse_descs_1 */
        else if (a_ClientContext[index].P2PWriteToServerValueHdl == gattCharValueHdl)
        {
          a_ClientContext[index].P2PWriteToServerDescHdl = handle;
          LOG_INFO_APP("P2PWrite found : Desc UUID=0x%04X handle=0x%04X-0x%04X-0x%04X\n",
                       uuid, gattCharStartHdl, gattCharValueHdl, handle);
        }
        else if (a_ClientContext[index].P2PNotificationValueHdl == gattCharValueHdl)
        {
          a_ClientContext[index].P2PNotificationDescHdl = handle;
          LOG_INFO_APP("P2PNotification found : Desc UUID=0x%04X handle=0x%04X-0x%04X-0x%04X\n",
                       uuid, gattCharStartHdl, gattCharValueHdl, handle);
        }
/* USER CODE END gatt_parse_descs_1 */
        else
        {
          LOG_INFO_APP("\n");
        }
        UNUSED(gattCharStartHdl);
      }
      else
      {
        gattCharValueHdl = handle;

        LOG_INFO_APP("  UUID=0x%04X, handle=0x%04X", uuid, handle);

        if (uuid == DEVICE_NAME_UUID)
        {
          LOG_INFO_APP(", found GAP DEVICE_NAME_UUID\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          LOG_INFO_APP(", found GAP APPEARANCE_UUID\n");
        }
        else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID)
        {
          LOG_INFO_APP(", found GATT SERVICE_CHANGED_CHARACTERISTIC_UUID\n");
        }
/* USER CODE BEGIN gatt_parse_descs_2 */
        else if (uuid == ST_P2P_WRITE_CHAR_UUID)
        {
          LOG_INFO_APP(", found ST_P2P_WRITE_CHAR_UUID\n");
        }
        else if (uuid == ST_P2P_NOTIFY_CHAR_UUID)
        {
          LOG_INFO_APP(", found ST_P2P_NOTIFY_CHAR_UUID\n");
        }
/* USER CODE END gatt_parse_descs_2 */
        else
        {
          LOG_INFO_APP("\n");
        }
      }
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
  {
    LOG_INFO_APP("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
  LOG_DEBUG_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  GATT_CLIENT_APP_Notification_evt_t Notification;
  uint8_t index, dev_idx;

  for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  /* index < BLE_CFG_CLT_MAX_NBR_CB means connection handle identified */
  if (index < BLE_CFG_CLT_MAX_NBR_CB)
  {
    if (p_evt->Attribute_Handle == a_ClientContext[index].P2PNotificationValueHdl)
    {
      dev_idx = P2PR_getIndexFromConnHdl(a_ClientContext[index].connHdl);

      P2PR_setNotifLevel(dev_idx, p_evt->Attribute_Value[1]);

      p_evt->Attribute_Value[0] = dev_idx;
      Notification.Client_Evt_Opcode = P2P_NOTIFICATION_INFO_RECEIVED_EVT;
      Notification.DataTransfered.length = p_evt->Attribute_Value_Length;
      Notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];

      gatt_Notification(&Notification);
    }
  }
  else
  {
    LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
  }
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  uint8_t index = 0;
  /* USER CODE BEGIN client_discover_1 */

  /* USER CODE END client_discover_1 */

  GATT_CLIENT_APP_Discover_services(index);

  /* USER CODE BEGIN client_discover_2 */

  /* USER CODE END client_discover_2 */
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

static void P2Pclient_write_char(void)
{
  uint8_t index, indexRouter;
  tBleStatus ret;
  uint8_t writeValLen;
  uint32_t writeVal_addr;
  uint8_t *p_writeVal;
  uint16_t connHdlRouter;
  
  P2PR_getWriteData(&writeVal_addr, &writeValLen);
  p_writeVal = (uint8_t*)writeVal_addr;
  
  indexRouter = p_writeVal[0];
  connHdlRouter = P2PR_getConnHdlFromIndex(indexRouter);
  
  p_writeVal[0] = 0x01;
  
  for(index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if ((a_ClientContext[index].state != GATT_CLIENT_APP_IDLE) &&
        ((indexRouter == 0xFF) ||
         (a_ClientContext[index].connHdl == connHdlRouter)))
    {
      ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                        a_ClientContext[index].P2PWriteToServerValueHdl,
                                        writeValLen, 
                                        p_writeVal);
      
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].P2PWriteToServerValueHdl);
      }
      else
      {
        LOG_INFO_APP("aci_gatt_write_without_resp success, connHdl=0x%04X, ValueHdl=0x%04X\n",
          a_ClientContext[index].connHdl,
          a_ClientContext[index].P2PWriteToServerValueHdl);
      }
    }
  }

  HostStack_Process();

  return;
}

/* USER CODE END LF */
